# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран

a = 1
b = "Строка"
c = 5454.7
is_true = False
colors = ["red", "blue", "yellow"]
other_values = ("hot", "violet", 5, False, 0.5)
dict = {"name": "John", "city": "Moscow", "age": 33}

print(a, b, c, is_true)
print(colors)
print(other_values)
print(dict)

v = input("Please, input string:")
print(v)
