# Задача-2: Запросите от пользователя число, сохраните в переменную,
# прибавьте к числу 2 и выведите результат на экран.
# Если возникла ошибка, прочитайте ее, вспомните урок и постарайтесь устранить ошибку.

try:
    a = int(input("Please, input number: "))
    print(a + 2)
except:
    print("Incorrect input!")
